# 时间数据的处理

In [1]:
import numpy as np
import pandas as pd
from collections import Counter
import pylab
import matplotlib.pyplot as plt

## 时间数据类型与转化

* 时间戳–timestamp

#### 定义时间戳

In [7]:
pd.Series([23,4])

0    23
1     4
dtype: int64

In [8]:
pd.DataFrame({2:[3,4],4:[2,3]})

   2  4
0  3  2
1  4  3

In [4]:
pd.to_datetime("20110404")

Timestamp('2011-04-04 00:00:00')

In [5]:
pd.to_datetime("2011/4/4")

Timestamp('2011-04-04 00:00:00')

In [6]:
pd.to_datetime("2011 4 4")

Timestamp('2011-04-04 00:00:00')

In [8]:
#pd.to_datetime("2011年04月04日")

In [3]:
pd.to_datetime(["2011/4/4","04/04/2011"])

DatetimeIndex(['2011-04-04', '2011-04-04'], dtype='datetime64[ns]', freq=None)

In [14]:
pd.Series(["2011-4-4","20110404"])

0    2011-4-4
1    20110404
dtype: object

In [4]:
r1=pd.Series(["2011-4-4","20110404"])
pd.to_datetime(r1)

0   2011-04-04
1   2011-04-04
dtype: datetime64[ns]

### 课间题目

In [4]:
#请把字符串“20181201”转换为时间戳

In [16]:
#请下载此数据，并导入，注意更改目录
r1=pd.read_csv(r"D:\t_alibaba_data3.txt",names=["user","brand","behavr","date"],sep="\t",dtype={"behavr":int})
#pandas会自己判断数据类型，但是有时也需要自己额外指定数据类型
r1.head()

       user  brand  behavr   date
0  10944750  13451       0  06/04
1  10944750  13451       2  06/04
2  10944750  13451       2  06/04
3  10944750  13451       0  06/04
4  10944750  13451       0  06/04

In [6]:
# 请把上面r1的第四列的数据的值前面都添加一个“2011/”，使得所有数据都变成类似“2011/07/04”的形式，并替代原始列

In [17]:
r1.date="2011/"+r1.date

In [18]:
r1.head()

       user  brand  behavr        date
0  10944750  13451       0  2011/06/04
1  10944750  13451       2  2011/06/04
2  10944750  13451       2  2011/06/04
3  10944750  13451       0  2011/06/04
4  10944750  13451       0  2011/06/04

In [18]:
r1.date="2011/"+r1.date

In [19]:
r1.head()

       user  brand  behavr        date
0  10944750  13451       0  2011/06/04
1  10944750  13451       2  2011/06/04
2  10944750  13451       2  2011/06/04
3  10944750  13451       0  2011/06/04
4  10944750  13451       0  2011/06/04

       user  brand  behavr        date
0  10944750  13451       0  2011/06/04
1  10944750  13451       2  2011/06/04
2  10944750  13451       2  2011/06/04
3  10944750  13451       0  2011/06/04
4  10944750  13451       0  2011/06/04

In [5]:
#请把已经变为标准形式第四列数据都转换为时间戳，并替代原始列

In [20]:
r1.date=pd.to_datetime(r1.date)

In [21]:
r1.date=pd.to_datetime(r1.date)

In [21]:
r1.head()

       user  brand  behavr       date
0  10944750  13451       0 2011-06-04
1  10944750  13451       2 2011-06-04
2  10944750  13451       2 2011-06-04
3  10944750  13451       0 2011-06-04
4  10944750  13451       0 2011-06-04

       user  brand  behavr       date
0  10944750  13451       0 2011-06-04
1  10944750  13451       2 2011-06-04
2  10944750  13451       2 2011-06-04
3  10944750  13451       0 2011-06-04
4  10944750  13451       0 2011-06-04

### 定义时间戳序列与周期的定义

* m月，D天，W星期，Y年

In [24]:
list(range(1,10,2))

[1, 3, 5, 7, 9]

In [25]:
r = pd.date_range('1/10/2011', periods=10, freq='5y')#用这个月最后一天代表这个月
r

DatetimeIndex(['2011-12-31', '2016-12-31', '2021-12-31', '2026-12-31',
               '2031-12-31', '2036-12-31', '2041-12-31', '2046-12-31',
               '2051-12-31', '2056-12-31'],
              dtype='datetime64[ns]', freq='5A-DEC')

In [26]:
#以时间戳为键的数据框
rng = pd.date_range('2019-01-01', periods=16, freq='D')
f1=pd.DataFrame({"a":np.random.randint(0,10,size=(len(rng))),"b":np.random.randint(0,10,size=(len(rng)))}, index=rng)
f1

            a  b
2019-01-01  3  8
2019-01-02  0  3
2019-01-03  9  1
2019-01-04  1  8
2019-01-05  1  2
2019-01-06  3  6
2019-01-07  3  6
2019-01-08  6  3
2019-01-09  0  4
2019-01-10  9  2
2019-01-11  3  1
2019-01-12  0  7
2019-01-13  8  6
2019-01-14  0  2
2019-01-15  7  9
2019-01-16  2  5

### 课间题目

In [7]:
#请创建如下一个长度为5，周期为星期的日期序列

DatetimeIndex(['2011-01-02', '2011-01-09', '2011-01-16', '2011-01-23',
               '2011-01-30'],
              dtype='datetime64[ns]', freq='W-SUN')

In [8]:
#请以上题的日期序列为索引，创建一个5行的数据框，其他随意

## 分组采样

* 注意7D与1W的区别

### 数据框的索引为时间

In [27]:
f1

            a  b
2019-01-01  3  8
2019-01-02  0  3
2019-01-03  9  1
2019-01-04  1  8
2019-01-05  1  2
2019-01-06  3  6
2019-01-07  3  6
2019-01-08  6  3
2019-01-09  0  4
2019-01-10  9  2
2019-01-11  3  1
2019-01-12  0  7
2019-01-13  8  6
2019-01-14  0  2
2019-01-15  7  9
2019-01-16  2  5

In [28]:
f1.groupby(pd.Grouper(freq='5D')).size()# 默认grouper对索引进行分组
#grouper函数是专门用来生成时间分组序列的函数，默认情况下是对数据框的键进行处理
#相比resample，grouper功能更加强大

2019-01-01    5
2019-01-06    5
2019-01-11    5
2019-01-16    1
Freq: 5D, dtype: int64

In [29]:
f1.groupby(pd.Grouper(freq='5D')).sum()

             a   b
2019-01-01  14  22
2019-01-06  21  21
2019-01-11  18  25
2019-01-16   2   5

In [32]:
f1.groupby(pd.Grouper(freq='w')).size()

2019-01-06    6
2019-01-13    7
2019-01-20    3
Freq: W-SUN, dtype: int64

In [34]:
f1.groupby(["a",pd.Grouper(freq='5D')]).size()

a
0  2019-01-01    1
   2019-01-06    1
   2019-01-11    2
1  2019-01-01    2
2  2019-01-16    1
3  2019-01-01    1
   2019-01-06    2
   2019-01-11    1
6  2019-01-06    1
7  2019-01-11    1
8  2019-01-11    1
9  2019-01-01    1
   2019-01-06    1
dtype: int64

In [37]:
#分组迭代
k=0
for i in f1.groupby(["a",pd.Grouper(freq='5D')]):
    print(i[1])

            a  b
2019-01-02  0  3
            a  b
2019-01-09  0  4
            a  b
2019-01-12  0  7
2019-01-14  0  2
            a  b
2019-01-04  1  8
2019-01-05  1  2
            a  b
2019-01-16  2  5
            a  b
2019-01-01  3  8
            a  b
2019-01-06  3  6
2019-01-07  3  6
            a  b
2019-01-11  3  1
            a  b
2019-01-08  6  3
            a  b
2019-01-15  7  9
            a  b
2019-01-13  8  6
            a  b
2019-01-03  9  1
            a  b
2019-01-10  9  2

### 索引不为时间

In [38]:
#已知一个数据框，时间数据并不是键
rng = pd.date_range('2000-01-01', periods=10, freq='D')
f2=pd.DataFrame({"a":np.random.randint(0,10,size=(len(rng))),"b":np.random.randint(0,10,size=(len(rng))),"date":rng})
f2

   a  b       date
0  0  4 2000-01-01
1  1  0 2000-01-02
2  5  5 2000-01-03
3  8  4 2000-01-04
4  1  9 2000-01-05
5  3  6 2000-01-06
6  0  8 2000-01-07
7  0  4 2000-01-08
8  9  6 2000-01-09
9  8  7 2000-01-10

In [40]:
f2.groupby(["b",pd.Grouper(key="date",freq='5D')]).sum()
#grouper还可以用在不以日期为键的数据里

               a
b date
0 2000-01-01   1
1 2000-01-01   6
  2000-01-06  12
2 2000-01-01   7
6 2000-01-01   7
  2000-01-06   9
8 2000-01-01   4
9 2000-01-06   5

## 课间题

In [21]:
# 请使用grouper的方式通过r1(r1的date不是索引)求每周的总购买量

In [41]:
r1[r1.behavr==1].groupby(pd.Grouper(key="date",freq="w")).size()

date
2011-04-17    164
2011-04-24    328
2011-05-01    317
2011-05-08    287
2011-05-15    376
2011-05-22    406
2011-05-29    342
2011-06-05    339
2011-06-12    330
2011-06-19    439
2011-06-26    369
2011-07-03    433
2011-07-10    463
2011-07-17    487
2011-07-24    323
2011-07-31    611
2011-08-07    435
2011-08-14    449
2011-08-21     86
Freq: W-SUN, dtype: int64

In [45]:
r1[r1.behavr==1].groupby(pd.Grouper(key="date",freq="W")).size()

date
2011-04-17    164
2011-04-24    328
2011-05-01    317
2011-05-08    287
2011-05-15    376
2011-05-22    406
2011-05-29    342
2011-06-05    339
2011-06-12    330
2011-06-19    439
2011-06-26    369
2011-07-03    433
2011-07-10    463
2011-07-17    487
2011-07-24    323
2011-07-31    611
2011-08-07    435
2011-08-14    449
2011-08-21     86
Freq: W-SUN, dtype: int64

### 重采样

* 相比groupby可以用在序列里，但是需要保证索引为时间

* 升降采样

* resample 的优势在于有丰富的参数设定：各区间哪边是闭合的（参数：closed） 如何标记各聚合面元，用区间的开头还是末尾（参数：label）

In [42]:
f1

            a  b
2019-01-01  3  8
2019-01-02  0  3
2019-01-03  9  1
2019-01-04  1  8
2019-01-05  1  2
2019-01-06  3  6
2019-01-07  3  6
2019-01-08  6  3
2019-01-09  0  4
2019-01-10  9  2
2019-01-11  3  1
2019-01-12  0  7
2019-01-13  8  6
2019-01-14  0  2
2019-01-15  7  9
2019-01-16  2  5

In [43]:
f1.resample("2D").sum()
#类似时间尺度上的groupby

             a   b
2019-01-01   3  11
2019-01-03  10   9
2019-01-05   4   8
2019-01-07   9   9
2019-01-09   9   6
2019-01-11   3   8
2019-01-13   8   8
2019-01-15   9  14

In [45]:
f1.a.resample("2d").sum()

2019-01-01     3
2019-01-03    10
2019-01-05     4
2019-01-07     9
2019-01-09     9
2019-01-11     3
2019-01-13     8
2019-01-15     9
Name: a, dtype: int32

In [24]:
f1.resample("2D")
#左闭合意味着，从小的时间（左边）开始算区间，左标记意味着用左边（小的时间）作为整个区间的标记
#以这里两天的周期为例，那么最后一个时间戳（右边）是不闭合的，因为只有它一个时间点，计算2天区间会让统计时间延伸到更大的区域
#默认都是左闭合左标记

DatetimeIndexResampler [freq=<2 * Days>, axis=0, closed=left, label=left, convention=start, base=0]

In [46]:
f1.resample("2D",closed='right').sum()
#右闭合会让统计区域延伸到更小的时间，所以这里从1999-12-30开始

             a   b
2018-12-30   3   8
2019-01-01   9   4
2019-01-03   2  10
2019-01-05   6  12
2019-01-07   6   7
2019-01-09  12   3
2019-01-11   8  13
2019-01-13   7  11
2019-01-15   2   5

* 升采样会让时间尺度变得更加细

In [47]:
f1.resample("10H").sum()
#resample会统计对应时间段的量，第一个区间为2000-01-01 00:00:00~2000-01-01 10:00:00

                     a  b
2019-01-01 00:00:00  3  8
2019-01-01 10:00:00  0  0
2019-01-01 20:00:00  0  3
2019-01-02 06:00:00  0  0
2019-01-02 16:00:00  9  1
2019-01-03 02:00:00  0  0
2019-01-03 12:00:00  0  0
2019-01-03 22:00:00  1  8
2019-01-04 08:00:00  0  0
2019-01-04 18:00:00  1  2
2019-01-05 04:00:00  0  0
2019-01-05 14:00:00  0  0
2019-01-06 00:00:00  3  6
2019-01-06 10:00:00  0  0
2019-01-06 20:00:00  3  6
2019-01-07 06:00:00  0  0
2019-01-07 16:00:00  6  3
2019-01-08 02:00:00  0  0
2019-01-08 12:00:00  0  0
2019-01-08 22:00:00  0  4
2019-01-09 08:00:00  0  0
2019-01-09 18:00:00  9  2
2019-01-10 04:00:00  0  0
2019-01-10 14:00:00  0  0
2019-01-11 00:00:00  3  1
2019-01-11 10:00:00  0  0
2019-01-11 20:00:00  0  7
2019-01-12 06:00:00  0  0
2019-01-12 16:00:00  8  6
2019-01-13 02:00:00  0  0
2019-01-13 12:00:00  0  0
2019-01-13 22:00:00  0  2
2019-01-14 08:00:00  0  0
2019-01-14 18:00:00  7  9
2019-01-15 04:00:00  0  0
2019-01-15 14:00:00  0  0
2019-01-16 00:00:00  2  5

### 课间题目

In [51]:
r1.head()

       user  brand  behavr       date
0  10944750  13451       0 2011-06-04
1  10944750  13451       2 2011-06-04
2  10944750  13451       2 2011-06-04
3  10944750  13451       0 2011-06-04
4  10944750  13451       0 2011-06-04

In [4]:
#下面的命令是把数据的date列设置为索引,因为resample前提是必须以时间做索引，请先运行此命令
r2=r1.set_index('date')
r2.head()

           user  brand  behavr
date
06/04  10944750  13451       0
06/04  10944750  13451       2
06/04  10944750  13451       2
06/04  10944750  13451       0
06/04  10944750  13451       0

In [ ]:
#请统计每周的记录数

date
2011-04-17     4142
2011-04-24     8524
2011-05-01     7674
2011-05-08     8318
2011-05-15     8472
2011-05-22    10223
2011-05-29     9520
2011-06-05    10116
2011-06-12     9613
2011-06-19    10465
2011-06-26    10024
2011-07-03    11167
2011-07-10    12285
2011-07-17    13891
2011-07-24    10298
2011-07-31    12990
2011-08-07    10754
2011-08-14    12045
2011-08-21     2359
Freq: W-SUN, dtype: int64

In [ ]:
#请统计每周的浏览量

## 作业

In [4]:
# 做下面题目钱请补全t_alibaba_data3.txt的日期为“2011/....”格式，并转化相应列为时间戳

In [ ]:
# 请问2011/07/01后的记录有多少行？(包含2011/07/01,可以用r1做也可以用r2做)

78783

In [ ]:
# 求每天的购买量

date
2011-04-15     63
2011-04-16     66
2011-04-17     35
2011-04-18     94
2011-04-19     53
2011-04-20     30
2011-04-21     50
2011-04-22     47
2011-04-23     36
2011-04-24     18
2011-04-25     32
2011-04-26     95
2011-04-27     45
2011-04-28     47
2011-04-29     61
2011-04-30     17
2011-05-01     20
2011-05-02     22
2011-05-03     54
2011-05-04     81
2011-05-05     41
2011-05-06     45
2011-05-07     14
2011-05-08     30
2011-05-09     44
2011-05-10     48
2011-05-11     75
2011-05-12     53
2011-05-13     77
2011-05-14     36
             ...
2011-07-17     55
2011-07-18     61
2011-07-19     59
2011-07-20     51
2011-07-21     47
2011-07-22     48
2011-07-23     24
2011-07-24     33
2011-07-25     70
2011-07-26    106
2011-07-27    112
2011-07-28    103
2011-07-29     68
2011-07-30     68
2011-07-31     84
2011-08-01     68
2011-08-02     63
2011-08-03     78
2011-08-04     73
2011-08-05     67
2011-08-06     39
2011-08-07     47
2011-08-08     67
2011-08-09     75
2011-08-10     47
2011-08-11     90
2011-08-12     63
2011-08-13     77
2011-08-14     30
2011-08-15     86
Freq: D, Length: 123, dtype: int64

In [ ]:
#求月度总购买量

date
2011-04-30     789
2011-05-31    1555
2011-06-30    1617
2011-07-31    2053
2011-08-31     970
Freq: M, dtype: int64

In [ ]:
#求各个用户的月度购买量

user      date
19500     2011-06-30     4
          2011-07-31     6
38250     2011-04-30     1
          2011-05-31     2
          2011-06-30     1
          2011-07-31     3
          2011-08-31     3
42000     2011-05-31     1
          2011-06-30     2
47000     2011-04-30     1
          2011-05-31     2
          2011-06-30     3
65500     2011-05-31     1
          2011-06-30     5
          2011-07-31     4
69500     2011-06-30     2
          2011-07-31     6
71250     2011-06-30     1
83250     2011-05-31     1
          2011-06-30     2
          2011-07-31     4
          2011-08-31     5
140500    2011-07-31     5
          2011-08-31     1
145750    2011-05-31     4
          2011-06-30     3
          2011-07-31     0
          2011-08-31     1
154500    2011-04-30     2
          2011-05-31     0
                        ..
12239250  2011-08-31     1
12275500  2011-05-31     1
          2011-06-30     4
          2011-07-31     1
          2011-08-31     1
12331000  2011-05-31     9
          2011-06-30     4
12337750  2011-07-31     2
12371000  2011-04-30     3
          2011-05-31     2
          2011-06-30     0
          2011-07-31    10
          2011-08-31     6
12377250  2011-04-30     1
          2011-05-31     1
          2011-06-30    12
          2011-07-31     6
          2011-08-31     2
12384250  2011-04-30     1
          2011-05-31     0
          2011-06-30     0
          2011-07-31     1
          2011-08-31     1
12386500  2011-06-30     2
12388250  2011-06-30     2
12417500  2011-04-30     2
          2011-05-31    11
          2011-06-30     2
          2011-07-31     9
          2011-08-31     2
Length: 2298, dtype: int64

In [ ]:
#求每个月购买量最多的用户

2011-04-30 00:00:00 3404000
2011-05-31 00:00:00 5780000
2011-06-30 00:00:00 8730250
2011-07-31 00:00:00 3913250
2011-08-31 00:00:00 472000

In [3]:
# 请求每周平均转化率（总浏览比上总购买）

date
2011-04-17    0.041446
2011-04-24    0.040349
2011-05-01    0.043318
2011-05-08    0.036087
2011-05-15    0.046854
2011-05-22    0.041594
2011-05-29    0.037467
2011-06-05    0.034891
2011-06-12    0.035768
2011-06-19    0.044218
2011-06-26    0.038510
2011-07-03    0.040577
2011-07-10    0.039424
2011-07-17    0.036586
2011-07-24    0.032699
2011-07-31    0.049683
2011-08-07    0.042630
2011-08-14    0.039183
2011-08-21    0.038205
Freq: W-SUN, dtype: float64

In [1]:
# 请求出各个商品每周的转化率

user      date
19500     2011-05-01    0.000000
          2011-05-08    0.000000
          2011-05-15    0.000000
          2011-05-22    0.000000
          2011-05-29    0.000000
          2011-06-05    0.000000
          2011-06-12    0.048780
          2011-06-19    0.043478
          2011-06-26    0.000000
          2011-07-03    0.000000
          2011-07-10    0.057143
          2011-07-17    0.046512
          2011-07-24    0.000000
          2011-07-31    0.166667
          2011-08-07    0.000000
          2011-08-14    0.000000
29750     2011-05-08    0.000000
38250     2011-04-17    0.000000
          2011-04-24    0.038462
          2011-05-01    0.000000
          2011-05-08    0.000000
          2011-05-15    0.000000
          2011-05-22    0.090909
          2011-05-29    0.000000
          2011-06-05    0.000000
          2011-06-12    0.000000
          2011-06-19    0.166667
          2011-06-26    0.000000
          2011-07-03    0.000000
          2011-07-10    0.000000
                          ...
12384250  2011-08-14    0.000000
12386500  2011-06-19    0.133333
          2011-06-26    0.000000
12388250  2011-04-24    0.000000
          2011-05-08    0.000000
          2011-05-15    0.000000
          2011-05-22    0.000000
          2011-06-05    0.000000
          2011-06-12    0.000000
          2011-06-19    0.000000
          2011-06-26    0.064516
          2011-07-03    0.000000
          2011-07-10    0.000000
          2011-07-24    0.000000
          2011-07-31    0.000000
          2011-08-07    0.000000
          2011-08-14    0.000000
12417500  2011-04-24         inf
          2011-05-08         inf
          2011-05-15         inf
          2011-05-22    0.142857
          2011-05-29         inf
          2011-06-12         inf
          2011-06-26         inf
          2011-07-10         inf
          2011-07-17         inf
          2011-07-24         inf
          2011-07-31         inf
          2011-08-07         inf
          2011-08-14         inf
Length: 11063, dtype: float64

In [2]:
#求出每周转化率最高的商品

2011-04-17 00:00:00 1617250
2011-04-24 00:00:00 2198750
2011-05-01 00:00:00 2198750
2011-05-08 00:00:00 1838000
2011-05-15 00:00:00 1446250
2011-05-22 00:00:00 282500
2011-05-29 00:00:00 1381000
2011-06-05 00:00:00 4304250
2011-06-12 00:00:00 12417500
2011-06-19 00:00:00 71250
2011-06-26 00:00:00 1324500
2011-07-03 00:00:00 3035250
2011-07-10 00:00:00 2626250
2011-07-17 00:00:00 4304250
2011-07-24 00:00:00 3001000
2011-07-31 00:00:00 3188000
2011-08-07 00:00:00 3188000
2011-08-14 00:00:00 190500
2011-08-21 00:00:00 5915250